package 용사키우기;


public class 그냥_출력_테스트용 {
//"+설정.blue+" "+설정.exit+"
	public static void main(String[] args) {
		String arr[] = { "\n\n\n\n\n\n\n\n\n\n\n\n", 
				"   |    |    (_____)    |    |   ",
				"   |  _ |   [|     |]   |    |   ",
				"   | / \\|    )     (    |    |   ",
				"   | | ||   |       |   |    |   ",
				"   | | /                 \\ 3 |   ", 
				"   | |/                   \\  |   ",
				" 2 | /          ●          \\ | 4 ", 
				"   |/         \\/|\\          \\|  ",
				"   /           / \\           \\  ",
				};
		for (String i : arr) {
			System.out.println(i);
		}
		//║▌│█║▌│ █║▌│█│║▌║ ૮(   •ﻌ• )ა 🔨       ☆⠀ ╲⠀⠀ ⊹   ⠀.   ☆.  /\_/\   ϞϞ(๑⚈ ․̫ ⚈๑)∩ ◥▦◣ ▁▂▃▄▅▆▇▇▆▅▄▃▂▁:    ▄ █ ▄ █ ▄ ▄ █ ▄ █ ▄ █
	}//｀ヽ、ヽヽ｀ヽ｀、｀｀ヽ｀ヽ、ヽ、ヽ｀ヽ｀ヽ▏╲┈┈╲╱┈┈┈▏▕╮┃╰╮
}
/*
＼●　 ●＿　　＼●　 　＜●〉　* ● *
 />　 <│　　 /∨　　　│ 　* √|∨*
<＼　　∠＼　　/>　　　 〈〉　* /\*
~ 앗싸~ 오늘도 활기차게 발랄하게~ 오예~~!!! ^^
.             ⡞⠳⣄⣀ ⣀ ⣀⣠⠞⢷
　           ⣾ 　         ⣷
         　  ⠻⣄   ᦲ ᆺ ᦲ  ⣠⠟
    ˚₊‧꒰ა    ⣠⡿           ⢿⣄ ໒꒱ ‧₊˚
            ⠙⠛⠋         ⠙⠛⠋
　              ⢿⣀⣀⡿⢿⣀⣀⡿
*/
