package 용사키우기;

public class 그냥_출력_테스트용 {
//"+설정.blue+" "+설정.exit+"
	public static void main(String[] args) {
		int num = 4;
		String arr[] = {"\n\n\n\n\n\n\n\n\n\n\n\n",
				"        "+설정.BLUE_BACKGROUND_BRIGHT+"|  |  |  |  |"+설정.exit+"       ",
				"       "+설정.RED_BACKGROUND_BRIGHT+설정.white+"||  | | | |  ||"+설정.exit+"      ",
				"      "+설정.BLUE_BACKGROUND_BRIGHT+"| |  || O ||  | |"+설정.exit+"     ",
				"     "+설정.RED_BACKGROUND_BRIGHT+설정.white+"|  |  |  O  |  |  |"+설정.exit+"    ",
				"    "+설정.BLUE_BACKGROUND_BRIGHT+"||  | |       | |  ||"+설정.exit+"   ",
				"   "+설정.RED_BACKGROUND_BRIGHT+설정.white+"| |  || ▃▂▁▁▂▃ ||  | |"+설정.exit+"  ",
				"  "+설정.BLUE_BACKGROUND_BRIGHT+"|  |  |           |  |  |"+설정.exit+" ",
				"┌───────────────────────────┐",
				"│   "+설정.blue+"당신에게 "+설정.red+"알려줄 "+설정.blue+"것은 "+설정.red+"없네요."+설정.exit+"    │",
				"└───────────────────────────┘",
				"  1.잡아먹기  2.받아들이기  3.공격  ",
				};
		for(String i:arr) {
			System.out.println(i);
		}//║▌│█║▌│ █║▌│█│║▌║ ૮(   •ﻌ• )ა 🔨       ☆⠀ ╲⠀⠀ ⊹   ⠀.   ☆.  /\_/\    ♡Δ~~~Δ▲ ◥▦◣ ▁▂▃▄▅▆▇▇▆▅▄▃▂▁
	}

}
/*
＼●　 ●＿　　＼●　 　＜●〉　* ● *
 />　 <│　　 /∨　　　│ 　* √|∨*
<＼　　∠＼　　/>　　　 〈〉　* /\*
~ 앗싸~ 오늘도 활기차게 발랄하게~ 오예~~!!! ^^*/
