package 용사키우기;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

public class 그냥_출력_테스트용 {
//"+설정.blue+" "+설정.exit+"
	public static void main(String[] args) {
		String arr[] = { "\n\n\n\n\n\n\n\n\n\n\n\n", 
				"        |┌─┐┌─┐┌─┐┌─┐┌─┐|        ",
				"        |└─┘└─┘└─┘└─┘└─┘|        ",
				"        |========" + 설정.red + "잡화상" + 설정.exit + "===|        ",
				"       /           ●‧     \\       ", 
				"      /   ________/█\\_____\\      ",
				"     /    |     ●          \\     ", 
				"    /         \\/|\\          \\   ",
				"   /           / \\           \\  ", 
				"┌───────────────────────────────────┐",
				"│당신은 무엇을 할건가?                    │",
				"└───────────────────────────────────┘",
				" 1.구매     2.대화     3.공격" };
		for (String i : arr) {
			System.out.println(i);
		}
		//║▌│█║▌│ █║▌│█│║▌║ ૮(   •ﻌ• )ა 🔨       ☆⠀ ╲⠀⠀ ⊹   ⠀.   ☆.  /\_/\   ϞϞ(๑⚈ ․̫ ⚈๑)∩ ◥▦◣ ▁▂▃▄▅▆▇▇▆▅▄▃▂▁:    ▄ █ ▄ █ ▄ ▄ █ ▄ █ ▄ █
	}//｀ヽ、ヽヽ｀ヽ｀、｀｀ヽ｀ヽ、ヽ、ヽ｀ヽ｀ヽ▏╲┈┈╲╱┈┈┈▏▕╮┃╰╮
}
/*
＼●　 ●＿　　＼●　 　＜●〉　* ● *
 />　 <│　　 /∨　　　│ 　* √|∨*
<＼　　∠＼　　/>　　　 〈〉　* /\*
~ 앗싸~ 오늘도 활기차게 발랄하게~ 오예~~!!! ^^
.             ⡞⠳⣄⣀ ⣀ ⣀⣠⠞⢷
　           ⣾ 　         ⣷
         　  ⠻⣄   ᦲ ᆺ ᦲ  ⣠⠟
    ˚₊‧꒰ა    ⣠⡿           ⢿⣄ ໒꒱ ‧₊˚
            ⠙⠛⠋         ⠙⠛⠋
　              ⢿⣀⣀⡿⢿⣀⣀⡿
*/
