package 용사키우기;


public class 그냥_출력_테스트용 {
//"+설정.blue+" "+설정.exit+"
	public static void main(String[] args) {
		String arr1[] = {"\n\n\n\n\n\n\n\n\n\n\n\n\n",
				"⠀⠀    "+설정.yellow+"⢀⠤⢤⡀"+설정.exit,
				"⠀   "+설정.yellow+"⢰⠃ ⢠⠇"+설정.exit,
				"   ⠀"+설정.yellow+"⣇⢀⠞"+설정.exit,
				"⠀⠀⠀⠀"+설정.red+"⚈"+설정.exit,
				};
		for(String i:arr1) {
			System.out.println(i);
		}
		설정.sleep(2000);
		String arr2[] = {"\n\n\n\n\n\n\n\n\n\n\n\n\n",
				"⠀⠀    "+설정.yellow+"⢀ ⠤  ⢤⡀"+설정.exit,
				"⠀   "+설정.yellow+"⢰ ⠃   ⢠ ⠇"+설정.exit,
				"   ⠀"+설정.yellow+"⣇ ⢀ ⠞"+설정.exit,
				"⠀⠀⠀⠀"+설정.red+"🌟"+설정.exit,
				};
		for(String i:arr2) {
			System.out.println(i);
		}
		String a = "hello 사랑해요 안녕하세요 마왕의 모략 ";
		a = a.replace("hello ", "");
		System.out.println(a);
		//║▌│█║▌│ █║▌│█│║▌║ ૮(   •ﻌ• )ა 🔨       ☆⠀ ╲⠀⠀ ⊹   ⠀.   ☆.  /\_/\   ϞϞ(๑⚈ ․̫ ⚈๑)∩ ◥▦◣ ▁▂▃▄▅▆▇▇▆▅▄▃▂▁:    ▄ █ ▄ █ ▄ ▄ █ ▄ █ ▄ █
	}//｀ヽ、ヽヽ｀ヽ｀、｀｀ヽ｀ヽ、ヽ、ヽ｀ヽ｀ヽ▏╲┈┈╲╱┈┈┈▏▕╮┃╰╮
}
/*
＼●　 ●＿　　＼●　 　＜●〉　* ● *
 />　 <│　　 /∨　　　│ 　* √|∨*
<＼　　∠＼　　/>　　　 〈〉　* /\*
~ 앗싸~ 오늘도 활기차게 발랄하게~ 오예~~!!! ^^
.             ⡞⠳⣄⣀ ⣀ ⣀⣠⠞⢷
　           ⣾ 　         ⣷
         　  ⠻⣄   ᦲ ᆺ ᦲ  ⣠⠟
    ˚₊‧꒰ა    ⣠⡿           ⢿⣄ ໒꒱ ‧₊˚
            ⠙⠛⠋         ⠙⠛⠋
　              ⢿⣀⣀⡿⢿⣀⣀⡿

.⠀⢰⠒⠒⠒⢲⠆⠀⠀⢀⠤⢤⡀⠀⡴⠀⠀⢀⣀⣀⣰⣀⣀⡀⠀⠀⠀⠀⠀
⠀⠀⣎⣀⣀⣀⡜⠀⠀⢰⠃⠀⢠⠇⢰⠓⠂⠀⢀⠔⠒⠒⠲⡄⠀⠀⠀⠀⠀⠀
⠤⠤⠤⣤⠤⠤⠤⠄⠀⣇⠀⢀⠞⢀⡯⠤⠀⠀⠹⠤⡤⠤⠞⠁⠀⢠⠔⢤⣀⠆
 ⠀⠀⢀⡏⠀⠀⠀⠀⠀⠈⠉⠁⠀⡸⠀⠀⠠⠤⠤⠴⠧⠤⠤⠄⠀⠀⠀⠀⠀

*/
