package 용사키우기;
public class 그냥_출력_테스트용 {
//"+설정.blue+" "+설정.exit+"
	public static void main(String[] args) {
		용사 user = new 용사();
		String arr1[] = {
				설정.back_yellow+"흠...? 궁정마법사 셰리? 이놈의 신원을 확인해줘",
				설정.purple+"도망가십시오 전하. 이 자에게서 엄청난 살의가 느껴집니다...",
				설정.back_yellow+설정.black+"무...무슨...?",
				설정.back_black+설정.purple+"감히 나의 소중한 에스토니아를....",
				설정.back_yellow+설정.black+"윽... 이 녀석 설마...?",
				설정.back_black+설정.purple+"너도 알고 있겠지.. 오늘 여기는 너의 무덤이 되는 동시에 에스토니아가 될 예정이다.", 
				설정.back_yellow+설정.black+"셰리!! 빨리 저 녀석을 죽여라!!!!!!!",
				"셰리? 왜 그래 셰리...?",
				설정.purple+"전하... 저는 이 자를 이길 수 없습니다...",
				"전하 빨리 제가 시간을 벌 동ㅇ..."+설정.exit,
				"(셰리의 몸이 빠르게 잠식당한다...)",
				설정.back_yellow+설정.black+"으...으악!!!!! 사람 살려!!!!",
				"제발... 내 모든 것을 바칠테니 목숨만은...",
				설정.back_black+설정.purple+"절대 그럴순 없지... 내 행복한 복수를 위해선... 피가 필요해...",
				설정.back_yellow+설정.black+"살ㄹ",
				설정.back_black+설정.purple+"하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하\n"
						+ "하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하\n"
						+ "하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하\n"
						+ "하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하\n"
						+ "하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하\n"
						+ "하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하\n"
						+ "하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하\n"
						+ "하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하\n"
						+ "하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하\n"
						+ "하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하하",
				"아주 만족스럽구나!!!! 맛있도다 맛있어!!!!"+설정.exit,
				};
		for(String i:arr1) {
			System.out.println(i);
			설정.sleep(2000);
		}
		설정.sleep(2000);
		String a = "hello 사랑해요 안녕하세요 마왕의 모략 ";
		a = a.replace("hello ", "");
		System.out.println(a);
		//║▌│█║▌│ █║▌│█│║▌║ ૮(   •ﻌ• )ა 🔨       ☆⠀ ╲⠀⠀ ⊹   ⠀.   ☆.  /\_/\   ϞϞ(๑⚈ ․̫ ⚈๑)∩ ◥▦◣ ▁▂▃▄▅▆▇▇▆▅▄▃▂▁:    ▄ █ ▄ █ ▄ ▄ █ ▄ █ ▄ █
	}//｀ヽ、ヽヽ｀ヽ｀、｀｀ヽ｀ヽ、ヽ、ヽ｀ヽ｀ヽ▏╲┈┈╲╱┈┈┈▏▕╮┃╰╮
}
/*
- ̗̀ෆ⎛˶'⩌'˶ ⎞ෆ ̖́- (⩌⩊⩌)
＼●　 ●＿　　＼●　 　＜●〉　* ● *
 />　 <│　　 /∨　　　│ 　* √|∨*
<＼　　∠＼　　/>　　　 〈〉　* /\*
~ 앗싸~ 오늘도 활기차게 발랄하게~ 오예~~!!! ^^
.             ⡞⠳⣄⣀ ⣀ ⣀⣠⠞⢷
　           ⣾ 　         ⣷
         　  ⠻⣄   ᦲ ᆺ ᦲ  ⣠⠟
    ˚₊‧꒰ა    ⣠⡿           ⢿⣄ ໒꒱ ‧₊˚
            ⠙⠛⠋         ⠙⠛⠋
　              ⢿⣀⣀⡿⢿⣀⣀⡿

.⠀⢰⠒⠒⠒⢲⠆⠀⠀⢀⠤⢤⡀⠀⡴⠀⠀⢀⣀⣀⣰⣀⣀⡀⠀⠀⠀⠀⠀
⠀⠀⣎⣀⣀⣀⡜⠀⠀⢰⠃⠀⢠⠇⢰⠓⠂⠀⢀⠔⠒⠒⠲⡄⠀⠀⠀⠀⠀⠀
⠤⠤⠤⣤⠤⠤⠤⠄⠀⣇⠀⢀⠞⢀⡯⠤⠀⠀⠹⠤⡤⠤⠞⠁⠀⢠⠔⢤⣀⠆
 ⠀⠀⢀⡏⠀⠀⠀⠀⠀⠈⠉⠁⠀⡸⠀⠀⠠⠤⠤⠴⠧⠤⠤⠄⠀⠀⠀⠀⠀

*/
