package 용사키우기;

public class 그냥_출력_테스트용 {
//"+설정.blue+" "+설정.exit+"
	public static void main(String[] args) {
		용사 user = new 용사();
		int num = 4;
		String arr[] = {"\n\n\n\n\n\n\n\n\n\n\n\n",
				"        ㅁㅁㅁㅁㅁㅁㅁ           ",
				"      ㅁㅁㅁㅁㅁㅁㅁㅁㅁㅁ         ",
				"     ㅁㅁㅁ       ㅁㅁㅁ        ",
				"     ㅁㅁㅁ       ㅁㅁㅁ        ",
				"                ㅁㅁㅁ        ",
				"               ㅁㅁㅁ         ",
				"              ㅁㅁㅁ          ",
				"             ㅁㅁㅁ           ",
				"            ㅁㅁㅁ            ",
				"           ㅁㅁㅁ             ",
				"           ㅁㅁㅁ             ",
				"           ㅁㅁㅁ             ",
				"                            ",
				"           ㅁㅁㅁ             ",
				"           ㅁㅁㅁ             ",
				"┌────────────────────────────┐",
				"│      최후를 알고 싶은 사람       │",
				"└────────────────────────────┘",
				"  1.잡아먹기  2.받아들이기  3.공격  ",
				};
		for(String i:arr) {
			System.out.println(i);
		}//║▌│█║▌│ █║▌│█│║▌║ ૮(   •ﻌ• )ა 🔨       ☆⠀ ╲⠀⠀ ⊹   ⠀.   ☆.  /\_/\    ♡Δ~~~Δ▲ ◥▦◣ ▁▂▃▄▅▆▇▇▆▅▄▃▂▁
	}

}
/*
＼●　 ●＿　　＼●　 　＜●〉　* ● *
 />　 <│　　 /∨　　　│ 　* √|∨*
<＼　　∠＼　　/>　　　 〈〉　* /\*
~ 앗싸~ 오늘도 활기차게 발랄하게~ 오예~~!!! ^^*/
