package 용사키우기;

public class 그냥_출력_테스트용 {
//"+설정.blue+" "+설정.exit+"
	public static void main(String[] args) {
		int num = 4;
		String arr[] = {"\n\n\n\n\n\n\n\n\n\n\n\n",
				"  |     |    |     |    |     |  ",
				"  |  1  |    |  2  |    |  3  |  ",
				"  |     |    |     |    |     |  ",
				"  (_____)    (_____)    (_____)  ",
				"                                 ",
				"   ●   |     |    |     |       ",
				" \\/|\\  |  4  |    |  5  |       ",
				"  / \\  |     |    |     |       ",
				"       (_____)    (_____)       ",
				};
		for(String i:arr) {
			System.out.println(i);
		}//║▌│█║▌│ █║▌│█│║▌║ ૮( • ﻌ • )ა 🔨       ☆⠀ ╲⠀⠀ ⊹   ⠀.   ☆.  /\_/\    ♡Δ~~~Δ▲ ◥▦◣
	}

}
/*
＼●　 ●＿　　＼●　 　＜●〉　* ● *
 />　 <│　　 /∨　　　│ 　* √|∨*
<＼　　∠＼　　/>　　　 〈〉　* /\*
~ 앗싸~ 오늘도 활기차게 발랄하게~ 오예~~!!! ^^*/
