
while(True):
    
    print('**YONI.NET**')
    print('        _________________________________________________')
    print('검색|',end = '')
    s = input()
    
    if s == '요니' or s == 'yoni':
        print('\n    지식백과\n    *요니*\n     게임 좋아하고 뭔갈 만드는 것도 좋아하지만 공부만 싫어하는 존재이다.\n')
        print('\n    지식in','\n','    Q.요니가 뭔가요?','\n','    A.요니입니다.\n')
    elif s == '번역기' or s == 'qjsdurrl':
        print("\n    번역기    영어    ->    한국어\n           I don't do     난 숙제하지 \n           my homwork     않았어\n ")
    elif s == '하진이' or s == '하또니' or s == '하찌니':
        print('\n    지식백과\n    *하진이*\n     매우 귀여운 존재이다.\n')
        print('\n    뉴스\n    #속보#\n    "서울 도심지 한복판에서 하진이 출몰. 많은 사람 쓰러져..."\n')
    elif s == '하연이' or s == '쪼꼬미':
        print('\n    지식백과\n    *하연이*\n     쪼꼼한 귀여운 존재.\n')
        print('\n    VIEW\n    -오늘 쪼꼬미 봤는데..-\n     오늘 쪼꼬미 봤는데 너무 쪼꼼해서 귀여웠어욯ㅎㅎㅎㅎ\n')
    elif s == '오늘의 뉴스' or s == '뉴스':
        print('\n    뉴스\n    연합뉴스\n     (10일) 아침 최저기온은 부산 25도, 울산 25도, 경상남도 23~25도로 오늘(9일, 19~25도)보다 1~4도 높겠고...\n')
        print('\n    JTBC\n     "내가 감독이 되겠어!"라는 결연한 의지가 있었던 것은 아니라 좋게 봐 주시는 시선과 오늘의 극장 상영...\n')
    elif s == '구글' or s == 'google':
        print('\n    Google\n    www.google.co.kr\n    검색 환경설정- 번역, 웹 기록, 도서, 지도, 쇼핑\n    검색 서비스, 웹, 이미지, 동영상, 지도, 뉴스, 학술 검색 및 번역 서비스 제공.\n')
    #elif s == 'naver' or s == '네이버':
    elif s == '뀨':
        print('\n   국어사전\n    뀨[뀨]\n    남에게 귀엽게 보이기 위하여 애교스럽게 내는 소리.\n')
        print('\n    지식in\n    Q.그냥 아무말이나 달아보세요. 맘에들면 채택합니다\n    A.뀨?\n')
    elif s == '박하':
        print('\n    지식백과\n    *박하*\n    데브의 억까와 사랑을 동시에 받는 박하사탕이다.\n')
        
    elif s == 'end' or s == '끝' or s == '안해':
        print('YONI NET을 이용해주셔서 감사합니다.')
        break
    else :
        print("\n\n지송해유 이건 등록이 안됐어유\n\n")
        
              
    
   
